# NewXYZ Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
Application..::..NewXYZ Method
Application Class See Also
---
Creates a XYZ object at the origin.
**Namespace:** Autodesk.Revit.Creation**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public XYZ NewXYZ()
```

Visual Basic
---
```text
Public Function NewXYZ As XYZ
```

Visual C++
---
```text
public:
XYZ^ NewXYZ()
```

# See Also
Application Class
NewXYZ Overload
Autodesk.Revit.Creation Namespace